# WPX-YOLO Parameters  with   scale='s'
nc: 1  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call 0.0yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [64, 96]]  # 0-P2/4
  - [-1, 3, C2f, [128,True]]  # stage 1

  - [-1, 1, DWConv, [256, 3, 2, 1, False]]  # 2-P3/8
  - [2, 1, C2f, [128]] # 3-P3/8
  - [2, 6, RGHBlock, [48, 128, 3, True, True]]  # 4-P3/8
  - [[3, 4], 1, Concat, [1]] # 5-P3/8
  - [-1, 1, DWConv, [256, 1, 1, 1, False]]  # 6-P4/16

  - [-1, 1, DWConv, [256, 3, 2, 1, False]]  # 7-P4/16
  - [-1, 6, RGHBlock, [96, 512, 3, True, False]]  # 8 cm, c2, k, light, shortcut
  - [-1, 6, RGHBlock, [96, 512, 3, True, True]] # 9
  - [-1, 6, RGHBlock, [96, 512, 3, True, True]]  # 10 stage 3

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 11-P5/32
  - [-1, 6, RGHBlock, [192, 512, 3, True, False]]  # 12 stage 4
  - [-1, 1, SPPF, [512, 5]]  # 13

# YOLOv8.0n head
head:
  - [-1, 1, Conv, [256, 1, 1]] # 11
  - [6, 1, Conv, [256, 1, 1]] # 12
  - [[-1, 10, -2], 1, TFE, []]  # 13 cat backbone P4
  - [-1, 3, RFCE, [256,1]]  # 14

  - [-1, 1, Conv, [128, 1, 1]] # 15
  - [1, 1, Conv, [128, 1, 1]] # 16
  - [[-1, 6, -2], 1, TFE, []]  # 17  cat backbone P3
  - [-1, 3, RFCE, [128,1]]  # 18 (P3/8-small)

  - [-1, 1, DWConv, [128, 3, 2]] # 19
  - [[-1, 18], 1, Concat, [1]]  # 20 cat head P4
  - [-1, 3, RFCE, [256,1]]  # 21 (P4/16-medium)

  - [[6, 10, 12], 1, SSFF, [128]] # 22 args[inchane]
  - [[21, -1], 1, Add, []] # 23

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 24
  - [[-1, 1], 1, Concat, []]  # 25 cat backbone P2
  - [-1, 3, RFCE, [64,1]]  # 26 (P2/4-small)

  - [[1, 26, 24], 1, SSFF, [64]] # 27 args[inchane]
  - [[29, -1], 1, Add, []] # 28

  - [[31, 26, 24], 1, LDADH, [nc, 256]]  # Detect(P3, P4, P5)
